<?php

class CAdminAjaxInit extends Controller
{
	protected $html = array(); //Содержит все части HTML страницы
	protected $vars = array(); //Массив входящих данных

	//*********************************************************************************

	protected function __construct()
	{
		parent::__construct();
		$this->init();
	}

	//*********************************************************************************

	//В ajax не нужен [Определяется только потому, что у родителя он абстрактный и его нужно определить]
 	private function init()
 	{
 		$objAdminUser = AdminUser::getInstance();

 		if (!$objAdminUser->isAuthorized())
 		{
 			$this->objSOutput->error("Авторизируйтесь");
 		}
 	}

	//*********************************************************************************

	//В ajax не нужен [Определяется только потому, что у родителя он абстрактный и его нужно определить]
 	protected function templateInit()
 	{
 	}

	//*********************************************************************************

}

?>